; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	infrared2 - mode
	spectrograph1 - mode
	image3 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	GroundStation15 - direction
	GroundStation16 - direction
	Star17 - direction
	Star19 - direction
	GroundStation11 - direction
	GroundStation7 - direction
	Star2 - direction
	Star8 - direction
	GroundStation1 - direction
	Star6 - direction
	GroundStation18 - direction
	GroundStation3 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Planet23 - direction
	Planet24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Planet28 - direction
	Planet29 - direction
	Star30 - direction
	Phenomenon31 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation18)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star19)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet28)
)
(:goal (and
	(pointing satellite0 Planet24)
	(have_image Star20 spectrograph1)
	(have_image Star21 image3)
	(have_image Star22 infrared2)
	(have_image Planet23 infrared2)
	(have_image Planet24 infrared2)
	(have_image Planet25 spectrograph1)
	(have_image Phenomenon26 infrared0)
	(have_image Star27 spectrograph1)
	(have_image Planet28 infrared2)
	(have_image Planet29 infrared0)
	(have_image Star30 image3)
	(have_image Phenomenon31 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (turn_to satellite1 phenomenon31 planet28)
   deleted: (pointing satellite1 planet28)
   added: (pointing satellite1 phenomenon31)
   goals met: 0 of 13
4. (turn_to satellite0 phenomenon26 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 phenomenon26)
   goals met: 0 of 13
5. (turn_to satellite1 star6 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 star6)
   goals met: 0 of 13
6. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 13
7. (turn_to satellite1 phenomenon31 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon31)
   goals met: 0 of 13
8. (take_image satellite1 phenomenon31 instrument1 spectrograph1)
   added: (have_image phenomenon31 spectrograph1)
   goals met: 1 of 13
9. (turn_to satellite1 planet25 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 planet25)
   goals met: 1 of 13
10. (take_image satellite1 planet25 instrument1 spectrograph1)
   added: (have_image planet25 spectrograph1)
   goals met: 2 of 13
11. (turn_to satellite1 star20 planet25)
   deleted: (pointing satellite1 planet25)
   added: (pointing satellite1 star20)
   goals met: 2 of 13
12. (take_image satellite1 star20 instrument1 spectrograph1)
   added: (have_image star20 spectrograph1)
   goals met: 3 of 13
13. (turn_to satellite1 star21 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 star21)
   goals met: 3 of 13
14. (take_image satellite1 star21 instrument1 image3)
   added: (have_image star21 image3)
   goals met: 4 of 13
15. (turn_to satellite1 star27 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star27)
   goals met: 4 of 13
16. (take_image satellite1 star27 instrument1 spectrograph1)
   added: (have_image star27 spectrograph1)
   goals met: 5 of 13
17. (turn_to satellite1 star30 star27)
   deleted: (pointing satellite1 star27)
   added: (pointing satellite1 star30)
   goals met: 5 of 13
18. (take_image satellite1 star30 instrument1 image3)
   added: (have_image star30 image3)
   goals met: 6 of 13
19. (turn_to satellite0 star8 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 star8)
   goals met: 6 of 13
20. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 6 of 13
21. (turn_to satellite0 phenomenon26 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon26)
   goals met: 6 of 13
22. (take_image satellite0 phenomenon26 instrument0 infrared0)
   added: (have_image phenomenon26 infrared0)
   goals met: 7 of 13
23. (turn_to satellite0 planet23 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 planet23)
   goals met: 7 of 13
24. (take_image satellite0 planet23 instrument0 infrared2)
   added: (have_image planet23 infrared2)
   goals met: 8 of 13
25. (turn_to satellite0 planet24 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet24)
   goals met: 9 of 13
26. (take_image satellite0 planet24 instrument0 infrared2)
   added: (have_image planet24 infrared2)
   goals met: 10 of 13
27. (turn_to satellite0 planet28 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet28)
   goals met: 9 of 13
28. (take_image satellite0 planet28 instrument0 infrared2)
   added: (have_image planet28 infrared2)
   goals met: 10 of 13
29. (turn_to satellite0 planet24 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 planet24)
   goals met: 11 of 13
30. (turn_to satellite0 planet29 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet29)
   goals met: 10 of 13
31. (take_image satellite0 planet29 instrument0 infrared0)
   added: (have_image planet29 infrared0)
   goals met: 11 of 13
32. (turn_to satellite0 planet24 planet29)
   deleted: (pointing satellite0 planet29)
   added: (pointing satellite0 planet24)
   goals met: 12 of 13
33. (turn_to satellite0 star22 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 star22)
   goals met: 11 of 13
34. (take_image satellite0 star22 instrument0 infrared2)
   added: (have_image star22 infrared2)
   goals met: 12 of 13
35. (turn_to satellite0 planet24 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 planet24)
   goals met: 13 of 13
